wisteria-1c/Конфигурация/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеSMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonModules/УправлениеКонтактнойИнформациейУНФКлиент/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ИмяЭлементаДляРазмещения(Форма, Элемент) Экспорт
	
	ОтборРеквизитов = Новый Структура("ИмяРеквизита", Элемент.Имя);
	ОписаниеРеквизитаКИ = Форма["КонтактнаяИнформацияОписаниеДополнительныхРеквизитов"].НайтиСтроки(ОтборРеквизитов);
	Если ОписаниеРеквизитаКИ.Количество() <> 0 Тогда
		ИмяЭлементаДляРазмещения = ОписаниеРеквизитаКИ[0].ИмяЭлементаДляРазмещения;
	Иначе
		ИмяЭлементаДляРазмещения = Неопределено;
	КонецЕсли;
	
	Возврат ИмяЭлементаДляРазмещения;
	
КонецФункции

Функция ОбработчикДействияПозвонитьПоТелефону(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	Если ПустаяСтрока(КонтактнаяИнформация.Представление)
		И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяРеквизита) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для совершения звонка заполните номер телефона'"), , ДополнительныеПараметры.ИмяРеквизита);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТелефонияКлиент.ПоддерживаютсяВызовы() Тогда
		ТелефонияКлиент.ПозвонитьПоНомеру(КонтактнаяИнформация.Представление, ДополнительныеПараметры.ВладелецКонтактнойИнформации);
	Иначе
		ОбработчикДействияСозданияСобытия(КонтактнаяИнформация, ДополнительныеПараметры);
	КонецЕсли;
	
КонецФункции

// Выполняет открытие формы создания документа Событие (телефонный звонок) для планирования звонка контрагенту
//
// Параметры:
//  КонтактнаяИнформация - Структура - информация о контактном телефоне контрагнета.
//  ДополнительныеПараметры - Структура - данные по форме клиентского приложения из которого выполнен вызов процедуры.
//
Функция ОбработчикДействияЗапланироватьЗвонок(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	Если ПустаяСтрока(КонтактнаяИнформация.Представление)
		И ЗначениеЗаполнено(ДополнительныеПараметры.ИмяРеквизита) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для совершения звонка заполните номер телефона.'"), , ДополнительныеПараметры.ИмяРеквизита);
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработчикДействияСозданияСобытия(КонтактнаяИнформация, ДополнительныеПараметры, Истина);
	
КонецФункции

Функция ОбработчикДействияНаписатьTelegram(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	НомерТелефона = УправлениеКонтактнойИнформациейУНФКлиентСервер.НомерТелефонаВМеждународномФормате(КонтактнаяИнформация.Представление);
	Ссылка = "https://t.me/%1";
	Ссылка = СтрШаблон(Ссылка, НомерТелефона);
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
	
КонецФункции

Функция ОбработчикДействияНаписатьWhatsApp(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	НомерТелефона = УправлениеКонтактнойИнформациейУНФКлиентСервер.НомерТелефонаВМеждународномФормате(КонтактнаяИнформация.Представление);
	Ссылка = "https://wa.me/%1";
	Ссылка = СтрШаблон(Ссылка, НомерТелефона);
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
	
КонецФункции

Функция ОбработчикДействияЛичнаяВстреча(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	ОбработчикДействияСозданияСобытия(КонтактнаяИнформация, ДополнительныеПараметры);
	
КонецФункции

Функция ОбработчикДействияПрочееСобытие(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	ОбработчикДействияСозданияСобытия(КонтактнаяИнформация, ДополнительныеПараметры);
	
КонецФункции

Функция ОбработчикДействияНастроитьСвойстваАдреса(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
    
	КИОписаниеДополнительныхРеквизитов =
	ДополнительныеПараметры.Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	Если КИОписаниеДополнительныхРеквизитов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Отбор = Новый Структура( "Вид", КонтактнаяИнформация.Вид );
    КИОписаниеДополнительныхРеквизитовСтроки = КИОписаниеДополнительныхРеквизитов.НайтиСтроки( Отбор );
    Если КИОписаниеДополнительныхРеквизитовСтроки.Количество() = 0 Тогда
    	Возврат Неопределено;
    КонецЕсли;

   	КИОписаниеДополнительныхРеквизитовСтрока = КИОписаниеДополнительныхРеквизитовСтроки[0];	
	ИмяЭлементаДляРазмещения = КИОписаниеДополнительныхРеквизитовСтрока.ИмяЭлементаДляРазмещения;

	ДополнительныеПараметры.Вставить( "ИмяЭлементаДляРазмещения", ИмяЭлементаДляРазмещения);
    ДополнительныеПараметры.Вставить( "ВидКонтактнойИнформации", КонтактнаяИнформация.Вид );
    
   	Если КИОписаниеДополнительныхРеквизитовСтрока.ХранитьИсториюИзменений = Ложь Тогда
   	
	    // если хранение истории не включено, то предложим включить и поменять вид поля на "Диалог",
    	// так как в текущей версии БСП хранение истории допустимо только для "Диалог"
    	
		ОповещениеОЗавершении = Новый ОписаниеОповещения( 
		"НастроитьСвойстваАдресаПослеВопросаВключенияИстории", 
		УправлениеКонтактнойИнформациейУНФКлиент, 
		ДополнительныеПараметры);
   		
   		ВопросШаблон = НСтр( "ru = 'Для включения хранения истории вида адреса ""%1"" необходимо поменять способ ввода на ""Диалог"".
                              |Продолжить ?'" );
   		ВопросТекст = СтрШаблон( ВопросШаблон, КонтактнаяИнформация.Вид );
   		ПоказатьВопрос( ОповещениеОЗавершении, ВопросТекст, РежимДиалогаВопрос.ДаНетОтмена, , , 
   		НСтр( "ru = 'Включение истории для адреса'" ) );
   	КонецЕсли;
   	
    Возврат Неопределено;
	
КонецФункции

Функция ОбработчикДействияНаписатьВМессенджерWhatsApp(КонтактнаяИнформация, ДополнительныеПараметры) Экспорт
	
	МессенджерыWhatsAppКлиент.ОбработчикДействияНаписатьВМессенджерWhatsApp(КонтактнаяИнформация,
		ДополнительныеПараметры);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФукнции

Процедура НастроитьСвойстваАдресаПослеЗавершения(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
    
    Результат = Неопределено;
    УправлениеКонтактнойИнформациейКлиент.ПослеЗакрытияФормыСпискаВидыКонтактнойИнформации(Результат,
    	ДополнительныеПараметры);
		
КонецПроцедуры

Процедура НастроитьСвойстваАдресаПослеВопросаВключенияИстории(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если КонтактнаяИнформацияУНФВызовСервера.АдресВключитьХранениеИстории( 
		ДополнительныеПараметры.ВидКонтактнойИнформации ) <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Неопределено;
	УправлениеКонтактнойИнформациейКлиент.ПослеЗакрытияФормыСпискаВидыКонтактнойИнформации(Результат,
		ДополнительныеПараметры);
	
КонецПроцедуры

Функция ТипСобытияПоТипуКонтактнойИнформации(ТипКИ)
	
	Если ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Skype") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЛичнаяВстреча");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ЭлектронноеПисьмо");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ВебСтраница") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Другое") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Прочее");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ТелефонныйЗвонок");
	ИначеЕсли ТипКИ = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Факс") Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ТелефонныйЗвонок");
	Иначе
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПустаяСсылка");
	КонецЕсли;
	
	Возврат ТипСобытия;
	
КонецФункции

Процедура ОбработчикДействияСозданияСобытия(КонтактнаяИнформация, Знач ДополнительныеПараметры,
	ЭтоПланированиеЗвонка = Ложь)
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ВладелецКонтактнойИнформации) Тогда
		
		СоздатьСобытие(КонтактнаяИнформация, ДополнительныеПараметры);
		
	Иначе
		
		ДополнительныеПараметрыОповещения = Новый Структура;
		ДополнительныеПараметрыОповещения.Вставить("КонтактнаяИнформация", КонтактнаяИнформация);
		ДополнительныеПараметрыОповещения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		ДополнительныеПараметрыОповещения.Вставить("ЭтоПланированиеЗвонка", ЭтоПланированиеЗвонка);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикДействияСозданияСобытияВопросЗадан", ЭтотОбъект, ДополнительныеПараметрыОповещения);
		
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОписаниеОповещения,
		Новый ФорматированнаяСтрока(НСтр("ru = 'Данные еще не записаны.
		|Выполнение операции возможно только после записи данных.
		|Данные будут записаны.'")),
		РежимДиалогаВопрос.ОКОтмена,
		ПараметрыВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработчикДействияСозданияСобытияВопросЗадан(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат.Значение <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.ДополнительныеПараметры.Форма.Записать() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.ДополнительныеПараметры.Свойство("ВладелецКонтактнойИнформации")
		Или ТипЗнч(ДополнительныеПараметры.ДополнительныеПараметры.ВладелецКонтактнойИнформации) <>
		ТипЗнч(ДополнительныеПараметры.ДополнительныеПараметры.Форма.Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ДополнительныеПараметры.ВладелецКонтактнойИнформации =
	ДополнительныеПараметры.ДополнительныеПараметры.Форма.Объект.Ссылка;
	
	СоздатьСобытие(
	ДополнительныеПараметры.КонтактнаяИнформация,
	ДополнительныеПараметры.ДополнительныеПараметры,
	ДополнительныеПараметры.ЭтоПланированиеЗвонка);
	
КонецПроцедуры

Процедура СоздатьСобытие(КонтактнаяИнформация, ДополнительныеПараметры, ЭтоПланированиеЗвонка = Ложь);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипСобытия", ТипСобытияПоТипуКонтактнойИнформации(КонтактнаяИнформация.Тип));
	ЗначенияЗаполнения.Вставить("ОснованиеЗаполнения", ДополнительныеПараметры.ВладелецКонтактнойИнформации);
	
	Если ЭтоПланированиеЗвонка Тогда
		ЗначенияЗаполнения.Вставить("ИспользоватьНастройкиТелефонии", Ложь);
	КонецЕсли;
	
	ОткрытьФорму(
	"Документ.Событие.ФормаОбъекта",
	Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
	ДополнительныеПараметры.Форма);
	
КонецПроцедуры

#КонецОбласти
